my_dict = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    },
    "张学友": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    },
    "刘德华": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}
print(f"全体员工信息如下{my_dict}")

# 需求：级别为1的+1，且工资也+1000

# i 表示key值
for i in my_dict:
    # 表示如果该字典的key值里面的某项为1
    if my_dict[i]["级别"] == 1:
        # 获取员工信息
        # 把员工信息的键值对赋值给txt
        txt = my_dict[i]
        # 修改需要修改的项目
        txt["级别"] += 1
        txt["工资"] += 1000

print(f"升级后{my_dict}")
